# NumberOfSlots Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..NumberOfSlots Property
PanelScheduleData Class See Also
---
The number of slots in the panel schedule; setting this value must go through the appropriate update function
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfSlots { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSlots As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSlots {
	int get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace